{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/7ccdbf2b-b0d5-4b25-aba8-29c8e2745413')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7ccdbf2b-b0d5-4b25-aba8-29c8e2745413')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "NRT",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "Account Added or Removed from a sensitive or privileged group",
                "description": "Account has been added or removed from a sensitive or privileged group.",
                "severity": "High",
                "enabled": true,
                "query": "IdentityDirectoryEvents\r\n| extend AdditionalFieldsJson = parse_json(AdditionalFields)\r\n| where tostring(AdditionalFieldsJson[\"TO.GROUP_ID\"]) == \"3b571c19-9e9d-43f1-9a79-8a0d9ed637c7\" //Domain admin group id\r\n    or tostring(AdditionalFieldsJson[\"FROM.GROUP_ID\"]) == \"3b571c19-9e9d-43f1-9a79-8a0d9ed637c7\" //Domain admin group id\r\n    or tostring(AdditionalFieldsJson[\"TO.GROUP_ID\"]) == \"486202c5-443b-4a2a-b147-51afe7e66abf\" // Enterprise Admin group ID\r\n    or tostring(AdditionalFieldsJson[\"FROM.GROUP_ID\"]) == \"486202c5-443b-4a2a-b147-51afe7e66abf\" // Enterprise Admin group ID\r\n    or tostring(AdditionalFieldsJson[\"TO.GROUP_ID\"]) == \"7ceb18d6-f81a-452f-93fb-ab34481bc4a8\" //Administrators group ID\r\n    or tostring(AdditionalFieldsJson[\"FROM.GROUP_ID\"]) == \"7ceb18d6-f81a-452f-93fb-ab34481bc4a8\" //Administrators group ID\r\n| extend \r\n    ToGroupId = tostring(AdditionalFieldsJson[\"TO.GROUP_ID\"]),\r\n    FromGroupId = tostring(AdditionalFieldsJson[\"FROM.GROUP_ID\"]),\r\n    ToGroupName = tostring(AdditionalFieldsJson[\"TO.GROUP\"]),\r\n    FromGroupName = tostring(AdditionalFieldsJson[\"FROM.GROUP\"]),\r\n    TargetAccountSid = tostring(AdditionalFieldsJson[\"TargetAccountSid\"])\r\n| extend GroupName = coalesce(ToGroupName, FromGroupName)\r\n| extend GroupID = coalesce(ToGroupId, FromGroupId)\r\n| extend AssignedUserName = substring(TargetAccountUpn, 0, indexof(TargetAccountUpn, \"@\"))\r\n| extend AssignedDomain = substring(TargetAccountUpn, indexof(TargetAccountUpn, \"@\") + 1)\r\n| project Time=TimeGenerated, AssignedUser=TargetAccountDisplayName, AssignedAccountName=AssignedUserName, AssignedUserUPN=TargetAccountUpn, AssignedDomain, AssignedUserSid=TargetAccountSid, GroupName, GroupID, Action=AdditionalFieldsJson.MembershipChange, AssignerUser=AccountDisplayName, AssignerAccountName=AccountName, AssignerUserUPN=AccountUpn, AssignerSid=AccountSid, AssignerObjectId=AccountObjectId, AssignerDomain=AccountDomain",
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [
                    "Persistence"
                ],
                "techniques": [
                    "T1098"
                ],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": {},
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "AssignedAccountName"
                            },
                            {
                                "identifier": "UPNSuffix",
                                "columnName": "AssignedDomain"
                            },
                            {
                                "identifier": "Sid",
                                "columnName": "AssignedUserSid"
                            }
                        ]
                    },
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "AssignerAccountName"
                            },
                            {
                                "identifier": "UPNSuffix",
                                "columnName": "AssignerDomain"
                            },
                            {
                                "identifier": "Sid",
                                "columnName": "AssignerSid"
                            }
                        ]
                    },
                    {
                        "entityType": "SecurityGroup",
                        "fieldMappings": [
                            {
                                "identifier": "ObjectGuid",
                                "columnName": "GroupID"
                            },
                            {
                                "identifier": "DistinguishedName",
                                "columnName": "GroupName"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}