IdentityDirectoryEvents
| extend AdditionalFieldsJson = parse_json(AdditionalFields)
| where tostring(AdditionalFieldsJson["TO.GROUP_ID"]) == "3b571c19-9e9d-43f1-9a79-8a0d9ed637c7" //Domain admin group id
    or tostring(AdditionalFieldsJson["FROM.GROUP_ID"]) == "3b571c19-9e9d-43f1-9a79-8a0d9ed637c7" //Domain admin group id
    or tostring(AdditionalFieldsJson["TO.GROUP_ID"]) == "486202c5-443b-4a2a-b147-51afe7e66abf" // Enterprise Admin group ID
    or tostring(AdditionalFieldsJson["FROM.GROUP_ID"]) == "486202c5-443b-4a2a-b147-51afe7e66abf" // Enterprise Admin group ID
    or tostring(AdditionalFieldsJson["TO.GROUP_ID"]) == "7ceb18d6-f81a-452f-93fb-ab34481bc4a8" //Administrators group ID
    or tostring(AdditionalFieldsJson["FROM.GROUP_ID"]) == "7ceb18d6-f81a-452f-93fb-ab34481bc4a8" //Administrators group ID
| extend 
    ToGroupId = tostring(AdditionalFieldsJson["TO.GROUP_ID"]),
    FromGroupId = tostring(AdditionalFieldsJson["FROM.GROUP_ID"]),
    ToGroupName = tostring(AdditionalFieldsJson["TO.GROUP"]),
    FromGroupName = tostring(AdditionalFieldsJson["FROM.GROUP"]),
    TargetAccountSid = tostring(AdditionalFieldsJson["TargetAccountSid"])
| extend GroupName = coalesce(ToGroupName, FromGroupName)
| project TimeGenerated, TargetAccountDisplayName, TargetAccountUpn, GroupName, AccountSid, AccountObjectId, TargetAccountSid